# AllGridRotationForDivisionRule Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AllGridRotationForDivisionRule Property
ParameterTypeId Class See Also
---
"All Grid Rotation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AllGridRotationForDivisionRule { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AllGridRotationForDivisionRule As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AllGridRotationForDivisionRule {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace